transformation-library/src/test/resources/locationsummary/dsq.response/healthInsurancePermitNumberSuccess.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">5e80dc44-7065-4d50-9766-265a2928fc64</cais:TrackingId>
    <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">8e67414a-cb91-42eb-bd33-5145bbd28e80</cais:TransactionId>
    <cais:SessionID xmlns:cais="http://cais-icp.org/v1">4f0dd4ef206a450680de1e42683b7</cais:SessionID>
  </s:Header>
  <s:Body>
    <PRLO_IN202011CAQC_V01 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ITSVersion="XML_1.0"
                           xmlns="urn:hl7-org:v3">
      <id root="ede30e24-b5ba-426c-b254-4f3f4d422d91"/>
      <creationTime value="20211210183341"/>
      <responseModeCode code="I"/>
      <versionCode code="NE2006"/>
      <interactionId root="2.16.124.10.101.1.60.3.16" extension="PRLO_IN202011CAQC_V01" displayable="true"/>
      <processingCode code="D"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="senderRoot" extension="senderApplicationId" displayable="true" use="BUS"/>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </receiver>
      <respondTo xsi:nil="true"/>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
          <name>Registre ODS/LDS</name>
          <asAgent xsi:nil="true"/>
          <asLocatedEntity xsi:nil="true"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id root="c6ed068e-5406-4041-bfb9-01b634936a0f"/>
        </targetMessage>
      </acknowledgement>
      <controlActEvent classCode="CACT" moodCode="EVN">
        <id root="eventRoot" extension="eventCorrelationId" displayable="true" use="BUS"/>
        <code code="PRLO_TE202011CA"/>
        <statusCode code="completed"/>
        <subject typeCode="SUBJ" contextControlCode="ON" contextConductionInd="true">
          <registrationRequest classCode="REG" moodCode="RQO">
            <statusCode code="active"/>
            <subject typeCode="SBJ" contextControlCode="AN">
              <serviceDeliveryLocation classCode="SDLOC">
                <id root="2.16.840.1.113883.4.273" extension="1000022499" displayable="true"/>
                <code code="CPDEN"/>
                <name>CLINIQUE DENTAIRE EMERILLON</name>
                <addr use="PHYS">
                  <streetAddressLine partType="SAL">2886 AV DE LYON</streetAddressLine>
                  <additionalLocator partType="ADL">LONGUEUIL, QC</additionalLocator>
                  <city partType="CTY">LONGUEUIL</city>
                  <postalCode partType="ZIP">J4L3R2</postalCode>
                </addr>
                <statusCode code="NI"/>
                <location classCode="PLC" determinerCode="INSTANCE">
                  <code code="BLDG"/>
                  <mobileInd value="false"/>
                </location>
                <indirectAuthority typeCode="INDAUTH">
                  <territorialAuthority classCode="TERR">
                    <id root="2.16.124.10.101.1.60.1.10" extension="16" displayable="true"/>
                  </territorialAuthority>
                </indirectAuthority>
              </serviceDeliveryLocation>
            </subject>
            <custodian typeCode="CST" contextControlCode="AP">
              <assignedDevice classCode="ASSIGNED">
                <id root="2.16.124.10.101.1.60.2.11" extension="ODS" displayable="true" use="BUS"/>
                <assignedRepository classCode="DEV" determinerCode="INSTANCE">
                  <name>Registre ODS/LDS</name>
                </assignedRepository>
                <representedRepositoryJurisdiction classCode="STATE" determinerCode="INSTANCE">
                  <name>Québec</name>
                </representedRepositoryJurisdiction>
              </assignedDevice>
            </custodian>
          </registrationRequest>
        </subject>
        <queryAck>
          <queryId root="c6ed068e-5406-4041-bfb9-01b634936a0f"/>
          <queryResponseCode code="OK"/>
          <resultTotalQuantity value="1"/>
          <resultCurrentQuantity value="1"/>
          <resultRemainingQuantity value="0"/>
        </queryAck>
        <queryByParameter>
          <queryId root="c6ed068e-5406-4041-bfb9-01b634936a0f"/>
          <parameterList>
            <address xsi:nil="true"/>
            <amendedSinceDateTime xsi:nil="true"/>
            <eHRRepositoryId xsi:nil="true"/>
            <locationMobileIndicator xsi:nil="true"/>
            <locationPlaceType xsi:nil="true"/>
            <nameContains xsi:nil="true"/>
            <nearAddress xsi:nil="true"/>
            <responsibleOrganizationId xsi:nil="true"/>
            <searchRadius xsi:nil="true"/>
            <OtherIDs>
              <value root="2.16.124.10.101.1.60.104" extension="21410" displayable="true"/>
            </OtherIDs>
          </parameterList>
        </queryByParameter>
      </controlActEvent>
    </PRLO_IN202011CAQC_V01>
  </s:Body>
</s:Envelope>
